In [1]:
import numpy as np
import pandas as pd

In [7]:
data=np.random.randn(4,3)

In [9]:
data

array([[ 1.58672901, -1.1076902 , -0.80869364],
       [ 0.20666353, -0.60489748,  0.07730407],
       [-0.57835128, -0.14437774,  0.95548981],
       [ 0.02764463,  0.61748508, -0.60382691]])

In [11]:
dataFrame=pd.DataFrame(data)

In [13]:
dataFrame

          0         1         2
0  1.586729 -1.107690 -0.808694
1  0.206664 -0.604897  0.077304
2 -0.578351 -0.144378  0.955490
3  0.027645  0.617485 -0.603827

In [15]:
dataFrame[0]

0    1.586729
1    0.206664
2   -0.578351
3    0.027645
Name: 0, dtype: float64

In [17]:
yeniDataFrame=pd.DataFrame(data,index=["atil","zeynep","atlas","mehmet"],
                           columns=["maas","yas","calismasaati"])

In [19]:
yeniDataFrame

            maas       yas  calismasaati
atil    1.586729 -1.107690     -0.808694
zeynep  0.206664 -0.604897      0.077304
atlas  -0.578351 -0.144378      0.955490
mehmet  0.027645  0.617485     -0.603827

In [21]:
yeniDataFrame["yas"]

atil     -1.107690
zeynep   -0.604897
atlas    -0.144378
mehmet    0.617485
Name: yas, dtype: float64

In [23]:
yeniDataFrame[["maas","yas"]]

            maas       yas
atil    1.586729 -1.107690
zeynep  0.206664 -0.604897
atlas  -0.578351 -0.144378
mehmet  0.027645  0.617485

In [25]:
yeniDataFrame

            maas       yas  calismasaati
atil    1.586729 -1.107690     -0.808694
zeynep  0.206664 -0.604897      0.077304
atlas  -0.578351 -0.144378      0.955490
mehmet  0.027645  0.617485     -0.603827

In [27]:
yeniDataFrame.loc["atil"]

maas            1.586729
yas            -1.107690
calismasaati   -0.808694
Name: atil, dtype: float64

In [31]:
yeniDataFrame.loc[["atil","zeynep"]]

            maas       yas  calismasaati
atil    1.586729 -1.107690     -0.808694
zeynep  0.206664 -0.604897      0.077304

In [35]:
yeniDataFrame.iloc[[0,2]]

           maas       yas  calismasaati
atil   1.586729 -1.107690     -0.808694
atlas -0.578351 -0.144378      0.955490